Repository: fredl99/YOURLS-Plugin--Share-Files
Catalog: l10n/upload-and-shorten-*.po
Languages: fr_fr

source: Send a file to your webserver and create a short-URL for it.
fr_fr: Envoyer un fichier et raccourcir son URL.

source: Select a file
fr_fr: Sélectionner un fichier

source: YOURLS database options
fr_fr: Paramètres

source: Custom shortname:
fr_fr: Raccourci personnalisé :

source: Custom title:
fr_fr: Titre personnalisé :

source: Filename conversions (optional)
fr_fr: Modification du nom de fichier (optionnel)

source: No conversion
fr_fr: Aucune modification

source: Filename will not be changed at all.
fr_fr: Le nom de fichier ne sera pas changé.

source: Browser-safe filename
fr_fr: Nom de fichier compatible avec les navigateurs

source: Recommended if the file should be accessed by web-browsers.
fr_fr: Recommandé si le fichier doit être accessible depuis un navigateur.

source: Randomize filename
fr_fr: Nom de fichier aléatoire

source: Browser-safe filenames with a slight protection against systematic crawling your web-directory.
fr_fr: Nom de fichier compatible avec les navigateurs + petite protection contre le scan du répertoire.

source: Drop extension
fr_fr: Supprimer l'extension de fichier

source: Hide the filetype. Can be combined with above options.
fr_fr: Cache le type de fichier. Peut être combiné avec les options précédentes.

source: Some webservers won't send correct headers and web-browsers may not handle the file correctly.
fr_fr: Certains serveurs enverront un mauvais en-tête de fichier et les navigateurs ne pourront pas traiter le fichier correctement.

source: Go!
fr_fr: Envoyer !

source: This plugin is hosted at
fr_fr: Ce plugin est hébergé sur

source: If you like it, remember someone spends his time working on it.
fr_fr: Si vous l'appréciez, rappelez-vous que quelqu'un a passé du temps à travailler dessus.

source: A cup of coffee might stimulate further improvements. ;-)
fr_fr: Un café pourrait l'aider à développer de nouvelles fonctionnalités. ;-)

source: You need to select a file to upload.
fr_fr: Vous devez sélectionner un fichier à envoyer.

source: successfully sent. These are the links to your file:
fr_fr: envoyé avec succès. Voici les liens vers votre fichier :

source: Short:
fr_fr: Raccourci :

source: Upload failed, sorry! The error was
fr_fr: Désolé, l'envoi a échoué ! L'erreur est
